
# Notes:
# check function checks if the file is within the types listed by the program and then continues
# sx.q = sign extend I think

# ENC IS: 
'''
.╡■4hæε4)R9÷▒íERSECURESUPE]SEC┤─¬┐╚⌂s─╕▒╢☻Σ¶╜↑ÇQ┘B┬M°═(┌üïε▒☼π♀ä Z%╝jâ▄Dú└¡;Iê│⌡╟τ⌡♦πΦ─MIq↓>║|╠l£▲Y♦░ÿ's                ♥╘>ìH-`÷}lX.½ïr‼┬µ`░¼xr╘├╔9I☼┌r╬à~φw>l%=W↨¬Z{↔;s-↕ █Ziî▀[iΩ`▄jÜº₧N╞≥Å|╘v█☼╦O■uφ▐ v♣±╫å╬_ m╛┤`?ÇúáWM╜↕╗G4RESùRERúÉFYfE[]XEF÷íöURESUPERSECUaESU╚▒ü╩┤╡└┤┤┬└~╜┐┐╥û0└ âa═$⌐k┐║╤¢╪°û∞g┼╜∙♥├║ I«♠.¬▐q\g┼0♥╘or↓░╠0╢a╬ùºîüvΓ\zⁿÿ┐Zàª¡τ♥¡WçaÖ⌠á±√[N;█Nà+¼9·)ñ~ì~¼‼½a,*¥DÄ☼¬ï▒z┤ÄTE░&§├É"rz▌Ö↔ën♫ç0►√X╦««U╛⌐c▄1y║♂ò∩£ΩαR▬ Üw]¥.╖1┼§s¶┼6¢1░é¼►ΘαÜì╩=`5═-├9b!ô♂⌂¥≤╤≈B(═ët╚N{µ,[≡♂   É╥(M=hT`JÑ£¼Å8Φad*ƒÉh╟qJ≡┌ⁿ┬╡╗Θg ù‼ Di#╜╤♀Ä(æ$╗vú≈ùÇ|╪&ók^ CòδjΦ{Se▲╞f└'♫oß·╝±Å╧ƒ]0?N+╤╔'¼ú╡Æ▐±α¼¬╪?S▬   ♂╟"⌠0δ╬↑8┘┴ºL≡╓┘⌐^│▬g─m▀ÅïE(@|»z╦↑╘░0╡═▼¥ÖbÿÅAÉ²AT╚fìMn╟¢╤ ▒á♣.Ω÷åq▓φ0╫ffb▀`6│c╩√8┤σL≈É┼¡c▼xS                                           Ω▌►K╠±Ü╙§à:Ñ3╫dp☼Eg|■9CΘ Θ♂bFç┼∩▓#0█╔@═æ╥·>╝_MDo]Pú╣ÄFÅ╤☺y├╣≡╖y♂╔φú╣ÆÄóc╟ô↕     ≈┤##♀5U'+ƒì:¼«~ìV☼/Rr♥Ñó↨7ZÑ¥L[▲▼h√OFCU╔HSUáÉUWYC]ZMSI≤íúSECURESUPERSRCUR╜┐ä├╣╦┐¬╢â╩▓┐B¿öí.u_↕Aÿ½‼▀iwg▌§u↑↓╝∞Y╥ttÆ~φ▬Ä⌂Qw≈»╗=7Pïô&┘↕k╟┌Z∞|-t↕LL7>√╗╓ατ%;µµ∩&+}▬↔í5æΦå┴■φ╤ü▬↔¿g┼§┌τê.ò╓ä"T█♦RΩîgΩi╓╥yà»₧₧╘\Gµ¬ñU┼≈»m6¢µuf╦♀_æ≡~v^næ¶├_K↨vôf♫d╕│`☼↨º¼⌡$ÿ↑|1┼EΩåÿúAƒ5Ñ7~┌ùhα╚ç^è╞å|┘▼=▬↔V╛▓)⌠╬xzHà0↕☺Jƒ7⌡┘►-vµxÑ⌂Ö=┐H6╪'qO≥π6mæVú]P§∩σ┌╜∩F|┤≥e%⌐╕.'úⁿD↕9l:L♂?&ÑHHf█♥┌2╧x D┴╤,►@╩Ω└ô/▌î┼*ù☺«↨`K!┘ß≥É!ƒy-▌§░≡ü▼▒Nε♣╡∞π║d µ½"u=[☻?√°P|r▲q4$ivÉÜK┘≈↨╨∞yá/H╒╧═ƒ;=       B▼Ö▌▲┘╩Nv▬º<ye⌐▲V"'k}ΘH╕Ñk±▌lÖ╩φ∩τá╚<┴◄a║Maµƒ▓╪I¿╣╟Ç8╪∞Γ☻☻╒▐╓ε╙▐╒∞╚▄▓▲
'''

def change():
	# some of the translations
	
	a = 'hello world'
	b = '╗║╝▒┴s╝▓╟╛⌐'

	a = '     '
	b = 'super'

	# a = 'hhhhh'
	# a = 'hhhhhhhhhhhhhhhhhhhhhhhhh'
	# b = '»½¸­º»­«½º­»½¸­º»­«½º­»½¸­º»­«'

	a = 'SUPERSECURESUPERSECURESUPERSECURESUPERSECURESUPERSECURESUPERSECURE'
	b = 'SUPERSECURESoPERË±r´Äª¿È¼ÁÅ°¥ÄÁ°Í½±€Åª¯ÈÿÖ Àu^Ù4@j˜<žW¨Þ‹Ï–BKV–4#	yç(úRÓ~`­]ª/%å*HG=yÐ?Ú	–aVïôWÊÈMÖM3?4^™"ô#3½uÔrWîeÓl™t¬8{®€§å‹¢ö‘þ)Ø=–7Œ(îF j£ò­Vù±€¢ ÆOõµ*RQ´õÀò…R[ ·aæ…¥ä²%}‚wJI¿>8’5„tpfÈò§†¼[(¤©sA¿^ÄY ÿ£Ã/Qv8EéŠÿ# ÑT•ž\\X”BL¿URExWPE¢žHGiRM[]P9õ¯–CURESUPERSECiRE'
	b = 'SUPERSECUaESUÈ±Ê´µÀ´´ÂÀ~½¿¿Ò–0À ƒaÍ$©k¿ºÑ›Øø–ìgÅ½ùÃºÿI®.ªÞq\\gÅ0Ôor°Ì0¶aÎ—§Œvâ\\zü˜¿Z…¦­ç­W‡a™ô ñû[N;ÛN…+¬9ú)¤~n~ ¬«a,*DŽª‹±z´ŽTE°&Ã"rzÝ™‰n‡0ûXË®®U¾©cÜ1yº•ïœêàR šw].·1ÅsÅ6›1°‚¬éàšÊ=`5Í-Ã9b!“óÑ÷B(Í‰tÈN{æ,[ð	Ò(M=hT`J¥œ¬8èad*ŸhÇqJðÚüÂµ»égÿ— Di#½ÑŽ(‘$»v£÷—€|Ø&¢k^ C•ëjè{SeÆfÀ\'oáú¼ñÏŸ]0?N+ÑÉ\'¬£µ’Þñà¬ªØ?S	Ç"ô0ëÎ8ÙÁ§LðÖÙ©^³gÄmß‹E(@|¯zËÔ°0µÍ·™b˜AýATÈfMnÇ›Ñ ± .êö†q²í0×ffbß`6³cÊû8´åL÷Å­cxS\nêÝKÌñšÓ…:¥3×dpEg|þ9CéÿébF‡Åï²#0ÛÉ@Í‘Òú>¼_MDo]P£¹ŽFÑyÃ¹ð·yÉí£¹’Ž¢cÇ“	÷´##5U\'+Ÿ :¬®~V/Rr¥¢7Z¥L[hûOFCUÉHSU UWYC]ZMSIó¡£SECURESUPERSRCUR½'
	b = 'SUPERSRCUR½¿„Ã¹Ë¿ª¶ƒÊ²¿B¨”¡.u_A˜«ßiwgÝu¼ìYÒtt’~íŽQw÷¯»=7P‹“&ÙkÇÚZì|-tLL7>û»Öàç%;æºæï&+}Í¡5‘è†ÁþíÑ¨gÅÚçˆ.•Ö„"TÛRêŒgêiÖÒy…¯žžÔ\\Gæª¤UÅ÷¯m6›æufË_‘ð~Òv^n‘Ã_Kv“fd¸³`§¬õ$˜|1ÅEê†˜£AŸ5¥7~Ú—hàÈ‡^ŠÆ†|Ù=V¾²ã#v&cg·œYE( …–V(à\\wòöz3ƒdIË1‹~YÌd\nYÍe ¿²r\'ÅSF)G\\ bª½t+Oê\n)ôÎxzH…0JŸ7õÙ-væx¥™=¿H6Ø\'qOòã6m‘V£]PïåÚ½ ïF|´òe%©¸.\'£üD9l:L?& ¥HHfÛÚ2Ïx DÁÑ,@ÊêÀ“/ÝŒÅ*—®`K!Ùáò!Ÿy-Ý°ð±Nîµìãºdÿæ«"u=[?ûøP|rq4$ivšKÙ÷ Ðìy /HÕÏÍŸ;=	B™ÝÙÊíNv§<ye©V"\'k}éH¸¥kñÝl™Êíïç È<ÁaºMaæŸ²ØI¨¹Ç€8ØìâÕÞÖîÓÞÕìÈÜ²	PDkšÀ({0pŠèÍ·ÅQäY(”T DñJšBÌ-9ròØ…Â#š‰ýrHö‘FRŠAÿ‰10âÞdä ²‡¾ÞFö¥ÞÅ÷És@J-¶—}ÁèÒÃÙÊÆ—ßŸ¬¯ º&9î&VjSe¬‡,)ÍÉM_2ï<Q)õ÷áá{C-[XYðŒ$2•Ž\\ZÑ¢ÛdÈTSE¦fRE£ SIfSMK]R9ö±¡ERSECURESUPEjSECÍ¾tÊÄÂ°Å»ª¨ÉÅtÆ½µªÆ„s»Â¾©¢¿ Šc2b¹;þ» ?IìAtº)0R®n.Y-mrárY™xnþ4ãO¬pª;SXÃ	ì6ë‰GÑ%ä‘¸lq`Ó½V‘›5uSêp\\¼M’ ÄaS¨ë5‘å×—=_{LýN€ƒåÓ„^ÓbX…ë˜Ýœ°®Šäž‚ël¦DßŽn=ñ©Ÿ<Ð©MbÞ@ Üë5D'
	for i in range(len(b)):
		try:
			print(ord(b[i]), ord(a[i]), chr(ord(b[i]) - ord(a[i])))
		except:
			continue

	a = '     ' # -> super entails 115 - 32 = 83, enc - 83 = dec
	b = 'super' # -> 115 - 83 = 32, enc - key = dec
	# dec + key = enc


def solve():
	f = open('./login.xlsx.enc', 'rb').read()
	f = ''.join([chr(i) for i in f])
	KEY = 'SUPERSECURE'
	ret_values = []
	# print(''.join([chr(i) for i in f]))
	for i in range(len(f)):
		print("i is: ", i)
		# enc - key = dec
		val = f[i]
		temp = (ord(val) - ord(KEY[i % len(KEY)]) )% 256
		ret_values.append(temp)
		
	print(ret_values)

	ret_bytes = b''
	f2 = open('temp.xlsx', 'wb')
	for i in ret_values:
		f2.write(bytes([i]))

	# Flag: HTB{M4lW4R3_4n4LY5I5_IN73r357iN9_57uFF}

		
def main():

	# change()
	solve()


if __name__ == '__main__':
	main()